HopeFOAM-0.1/tutorials/DG/2D/isentropicVortex/system/dgSolution
/*------------------------------------------------------------------------------------*\
|     __  ______  ____  ______ |                                                       |
|    / / / / __ \/ __ \/ ____/ | HopeFOAM: High Order Parallel Extensible CFD Software |
|   / /_/ / / / / /_/ / __/    |                                                       |
|  / __  / /_/ / ____/ /___    |                                                       |
| /_/ /_/\____/_/   /_____/    | Copyright(c) 2017-2017 The Exercise Group, AMS, China.|
|                              |                                                       |
\*------------------------------------------------------------------------------------*/
FoamFile
{
    version     0.1;
    format      ascii;
    class       dictionary;
    location    "system";
    object      dgSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
DG
{
    meshDimension       2;
    baseOrder           4;
}

solvers
{
    dgrho
    {
        tolerance       1e-12;
        relTol          0;
        kspSolver       preonly;
    }

    rhoU
    {
        tolerance       1e-12;
        relTol          0;
        kspSolver       preonly;
    }

    Ener
    {
        tolerance       1e-12;
        relTol          0;
        kspSolver       preonly;
    }

    "rho(1|2|3)"
    {
        tolerance       1e-12;
        relTol          0;
        kspSolver       preonly;
    }

    "rhoU(1|2|3)"
    {
        tolerance       1e-12;
        relTol          0;
        kspSolver       preonly;
    }

    "Ener(1|2|3)"
    {
        tolerance       1e-12;
        relTol          0;
        kspSolver       preonly;
    }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

// ************************************************************************* //
